cgueble/ESP8266_Door_Status/porte_thingspeaks/build/sketch/porte_thingspeaks.ino.cpp
#include <Arduino.h>
#line 1 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
#line 1 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <TimeLib.h>
#include <PubSubClient.h>
//#include <Codes_CGU.h>// contient toutes les variables avec les loggins et les codes
#include <C:\Users\cgueble\Documents\Arduino\Codes_CGU\Codes_CGU.h>
//****************Configuration pour Debug****************
const boolean SERIAL_PORT_LOG_ENABLE = true; //true pour avoir la console active et false pour la desactiver ; il faut la desactiver pour l'application car meme pour que "verrou"
const boolean AvecMail = true; //true pour activer les mails

//Declaration des compteurs
int Cpt_Verrou = 0;
int CptTrig = 0;
int CptTrigMax = 20;

//Connexion a Internet
/*const char* ssid0 = "YourSSID_0";//type your ssid
  const char* password0 = "YourPWD_0";//type your password
  const char* ssid1 = "YourSSID_1";//type your ssid
  const char* password1 = "YourPWD_1";//type your password
  const char* ssid2 = "YourSSID_2";//type your ssid
  const char* password2 = "YourPWD_2";//type your password
*/
String CurentSSID;
String CurentSSIDTry;
//Definition des chaines de characteres pour les mails
String MailContent = "no mail content defined\r\n";
String StringDate = "no date";
String StringTime = "no time";
String Release_Date = "12-02-2018";
//Definition des Inputs
const int IlsPorte = 2; //l'acquisition du statut de la porte se fera sur GPIO2 c'est a dire D2 c'est a dire la pin 3 de la carte ESP8266-E01 ; c'est une INPUT
const int Verrou = 3; //l'acquisition du statut du verrou se fera sur GPIO3 c'est a dire D8 c'est a dire la pin 7 de la carte ESP8266-E01 ; c'est une INPUT

//Definition des Outputs

//Variables de gestion de l'etat de la porte et des mails
char server_email[] = "smtp.orange.fr";
const unsigned int localPort = 2390;

boolean Status_IlsPorte = false;
boolean Status_Verrou = false;

boolean Old_Status_IlsPorte = false;
boolean Old_Status_Verrou = true;
boolean Status_Verrou_Change = false;
boolean TraitementVerrouEnCours = false;                 // true pour iniber la fonction verrou

int MaxDebounse = 8;

boolean statusCheck = false;
String MailToSend = "";
boolean DailyMailSent = true;
boolean DoorClosedBack = true; //true : porte refermee
boolean Update_needed = false;
long rssi; //pour mesure RSSI

//variables pour le gestion de la date et du temps
const char* ntpServerName = "time.nist.gov";
const int NTP_PACKET_SIZE = 48; // NTP time stamp is in the first 48 bytes of the message
byte packetBuffer[ NTP_PACKET_SIZE]; //buffer to hold incoming and outgoing packets
unsigned long secsSince1900 = 0;
const unsigned long seventyYears = 2208988800UL;
int Hour;
int Minute;
int Second;
int Day;
int DayofWeek; // Sunday is day 0
int Month;     // Jan is month 0
int Year;      // the Year minus 1900
int WeekDay;

//Variable pour la gestion de thingspeak
const char* server = "mqtt.thingspeak.com";// Define the ThingSpeak MQTT broker
unsigned long lastConnectionTime = 0; // track the last connection time
const unsigned long postingInterval = 1L * 1000L;// post data every 1 seconds
const unsigned long RegularpostingInterval = 10 * 60 * 1L * 1000L;// post data every 10 min
const unsigned long whatchDogValue = 60 * 60 * 1000L;// WhatchDog Value 60min
time_t epoch = 0; // contient
IPAddress ip;
IPAddress timeServerIP;

WiFiClient client;  // Initialize the Wifi client library.
WiFiUDP udp; //A UDP instance to let us send and receive packets over UDP
PubSubClient mqttClient(client); // Initialize the PuBSubClient library

//************************Debut de setup*************************
#line 88 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void setup();
#line 151 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void loop();
#line 330 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void UpdateTime();
#line 416 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void GetTimeByUDP();
#line 464 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void Read_Button(boolean IlsPorte, boolean Verrou);
#line 502 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void sendNTPpacket(IPAddress& address);
#line 528 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void sendDailyMail();
#line 551 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
byte sendEmail(String FcMailFrom, String FcMailTo, String FcMailContent, String FcThingspeakChannelAdress, String FcThingspeakChannelWriteAPIKey);
#line 653 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
byte eRcv();
#line 691 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void efail();
#line 725 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void reconnect();
#line 755 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void mqttpublish();
#line 771 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void mqttpublishtry();
#line 790 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void WifiConnexionManager();
#line 845 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void WifiConnectOwner(char* SSIDowner_fct, char* passwordowner_fct);
#line 877 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void WaitConnexion();
#line 88 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Door_Status\\porte_thingspeaks\\porte_thingspeaks.ino"
void setup() {
  delay(5000);
  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.begin(115200);
    Serial.print("debut de setup. SERIAL_PORT_LOG_ENABLE= ");
    Serial.println(SERIAL_PORT_LOG_ENABLE);
  }
  //Set up PIN in INPUT
  pinMode(IlsPorte, INPUT);//External PullDown
  pinMode(Verrou, INPUT_PULLUP);

  //Set up PIN in OUTPUT


  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println(F("IlsPorte= 2 (GPIO2), INPUT ExtPulldown"));
    Serial.println(F("Verrou= 3 (GPIO3), INPUT_PULLUP"));
    Serial.println(F("Begining of Setup"));
  }

