cgueble/ESP8266_Door_Status/porte_thingspeaks/build/sketch/porte_thingspeaks.ino.cpp
  while ((WiFi.status() != WL_CONNECTED)) {
    WifiConnexionManager();//Recherche reseau wifi + connexion
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print(".");
      delay(1000);
      Serial.print(".");
      delay(1000);
      Serial.print(".\r");
      delay(1000);
      Serial.println("   \r");
    }
  }//Loop connexion until Wifi Connetion is OK

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("");
    Serial.println("WiFi connected");
    Serial.print("Use this URL to connect: ");
    Serial.print("http://");
    Serial.print(WiFi.localIP());
    Serial.println("/");
  }

  udp.begin(localPort);// Start UDP port for connexion to NTP server

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("Starting UDP");
    Serial.print("Local port: ");
    Serial.println(udp.localPort());
  }

  GetTimeByUDP();
  UpdateTime();
  mqttClient.setServer(server, 1883);// Set the MQTT broker details

  //wifi_status_led_uninstall();

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("End of Setup");
  }
}// fin set up
//******************end of setup*************************************
//*******************************************************************
//******************start of loop************************************
void loop() {

  //LoopLog
  if(SERIAL_PORT_LOG_ENABLE){
  Serial.print(".\r");
  delay(100);
  Serial.print("0\r\n");
  }

  WifiConnectOwner((char*)ssid1,(char*)password1);
  UpdateTime();
  rssi = WiFi.RSSI();
  if (Year < 2016) { // si l'heure n'est pas configuree C est a dire si l'annee n'est pas bonne, alors on recupere l'heure sur le serveur NTP
    GetTimeByUDP();
    UpdateTime();
  }

  if (WiFi.status() != WL_CONNECTED) {// si la connexion WIFI est perdue, alors on relance le setup
    WiFi.disconnect();
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Connexion lost ");
    }
    setup();
  }

  Read_Button(IlsPorte, Verrou); // lecture du statut des contacts

  // si un changement de status est detecte, on essaye de mettre a jour le statut thingspeak
  if (Update_needed == true) {
    mqttpublishtry();
  }

  if (Status_Verrou != Old_Status_Verrou )
  {
    Status_Verrou_Change = true;
    Old_Status_Verrou = Status_Verrou;
    Cpt_Verrou = 0;
    while ((Cpt_Verrou <= 120) && (Status_IlsPorte == true)) { //??? Status_IlsPorte == true ou False ?????
      delay(1000);
      Read_Button(IlsPorte, Verrou);
      Cpt_Verrou = Cpt_Verrou + 1;
    }
  }
  else {
    Status_Verrou_Change = false;
  }


  if (Status_IlsPorte == false && DoorClosedBack == false) { //Detecte la refermeture de la porte
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println();
      Serial.println("Door closed back");
      Serial.println("1 minute d'attente avant de continuer le traitement");
    }
    DoorClosedBack = true;
    MailContent = String("Fermeture porte \r\n");
    UpdateTime();
    delay(60000);// wait for 1 minute before sending mail
    Read_Button(IlsPorte, Verrou);
    if (sendEmail(MailFrom, MailTo, MailContent, ThingspeakChannelAdress, ThingspeakWriteAPIKey)) {
      Old_Status_Verrou = Status_Verrou;
      Status_Verrou_Change = false;
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email sent");
      }
    }
    else
    {
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email failed");
      }
    }
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Ready for new acquisition");
    }
  }

  if ((Status_IlsPorte == true && DoorClosedBack == true )) //Detecte l'ouverture de la porte
  {
    DoorClosedBack = false;
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println();
      Serial.println("Door seen open");
      Serial.println("Debut traitement IlsPorte");
      Serial.println("1 minute d'attente avant de continuer le traitement");
    }
    MailContent = String("Ouverture porte \r\n");
    UpdateTime();
    delay(60000);// wait for 1 minute before sending mail
    Read_Button(IlsPorte, Verrou);
    if (Status_IlsPorte == false) {
      DoorClosedBack = true;
      MailContent = String("Ouverture et refermeture porte \r\n");
    }
    if (sendEmail(MailFrom, MailTo, MailContent, ThingspeakChannelAdress, ThingspeakWriteAPIKey)) {
      Old_Status_Verrou = Status_Verrou;
      Status_Verrou_Change = false;
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email sent");
      }
    }
    else
    {
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email failed");
      }
    }
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Ready for new acquisition");
    }
  }// fin Status_IlsPorte==true


  if (Status_Verrou_Change == true) { // traitement du changement d'Ã©tat du verrou
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Debut traitement Verrou");
      Serial.println();
      Serial.println("Verrou status changed");
      Serial.println("Debut traitement ILS verrou");
    }
    MailContent = String("Le statut du verrou change \r\n");
    UpdateTime();
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("mail content value=  ");
      Serial.println(MailContent);
    }
    delay(60000);// wait for 1 minute before sending mail
    Read_Button(IlsPorte, Verrou);
    if (sendEmail(MailFrom, MailTo, MailContent, ThingspeakChannelAdress, ThingspeakWriteAPIKey)) {
      Status_Verrou_Change = false;
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email sent");
      }
    }
    else
    {
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email failed");
      }
    }
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Ready for new acquisition");
    }
  }  //fin status_Verrou == true

  //debut daily mail

  if (Hour == 8) // tant qu'il est 8h locale, on re autorise le daily mail
  {
    DailyMailSent = false;
  }// fin rearm daily mail

  if ((Hour > 8) && (DailyMailSent == false)) // a partir de 9h00 locale, si le Daily mail n'a pas ete envoye, alors on l'envoie
  {
    sendDailyMail();
  }

  if (SERIAL_PORT_LOG_ENABLE) {
  Serial.print("millis() - lastConnectionTime = ");
  Serial.println(millis() - lastConnectionTime );
  }

  if (millis() - lastConnectionTime > RegularpostingInterval) {
    mqttpublishtry();
  }


if (millis() - lastConnectionTime > whatchDogValue) //whatch dog 
  {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println();
      Serial.println("Loop Whatch Dog activation -> relaunch Setup()");
    }
    setup();
  }


}//*****************END OF LOOP *******************

void UpdateTime() {
  StringDate = ""; // reset StringDate value
  StringTime = ""; // reset StringTime value
  Hour = hour();
  Minute = minute();
  Second = second();
  Year = year();
  Month = month();
  Day = day();
  WeekDay = weekday();

  if ((Month <= 3) || (Month > 10)) { // on est un mois d'hiver
    if ((Month == 3) && (Day - WeekDay > 24)) { //on est dans le dernier mois d'hiver et aprÃ¨s le dernier dimanche
      Hour = Hour + 2;
      StringTime += " UTC+2: ";
      if (Hour >= 22){
        Day = Day + 1;
      }
    }
    else { // toute la periode hivernale
      Hour = Hour + 1;
      StringTime += " UTC+1: ";
        if (Hour >= 23){
        Day = Day + 1;
      }
    }
  }
  else { // on est un mois d'aout
    if ((Month == 10) && (Day - WeekDay > 24)) { //on est dans le dernier mois d'aout et apres le dernier dimanche
      Hour = Hour + 1;
      StringTime += " UTC+1: ";
      if (Hour >= 23){
        Day = Day + 1;
      }
    }
    else { // toute la periode estivale
      Hour = Hour + 2;
      StringTime += " UTC+2: ";
      if (Hour >= 22){
        Day = Day + 1;
      }
    }
  }

  //StringDate += "Date: ";
  if (Day < 10) {
    StringDate += "0";
  }
  StringDate += Day;
  if (Month < 10) {
    StringDate += "/0";
  }
  else {
    StringDate += "/";
  }
  StringDate += Month;
  StringDate += "/";
  StringDate += Year;

  if (Hour < 10) {
    StringTime += "0";
  }
  StringTime += Hour;
  if (Minute < 10) {
    StringTime += ":0";
  }
  else {
    StringTime += ":";
  }
  StringTime += Minute;
  if (Second < 10) {
    StringTime += ":0";
  }
  else {
    StringTime += ":";
  }
  StringTime += Second;
  if (SERIAL_PORT_LOG_ENABLE) {
    //Serial.print("valeure de StringDate ");
    //Serial.println(StringDate);
    //Serial.print("valeure de StringTime ");
    //Serial.println(StringTime);
  }
}//End of Update Time


void GetTimeByUDP() {
  //get a random server from the pool
  WiFi.hostByName(ntpServerName, timeServerIP);

  sendNTPpacket(timeServerIP); // send an NTP packet to a time server
  // wait to see if a reply is available
  delay(1000);


