cgueble/ESP8266_Door_Status/porte_thingspeaks/build/sketch/porte_thingspeaks.ino.cpp
  int cb = udp.parsePacket();

  if (!cb) {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("no packet yet");
    }
  }
  else {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("packet received, length=");
      Serial.println(cb);
    }

    // We've received a packet, read the data from it
    udp.read(packetBuffer, NTP_PACKET_SIZE); // read the packet into the buffer

    //the timestamp starts at byte 40 of the received packet and is four bytes,
    // or two words, long. First, esxtract the two words:

    unsigned long highWord = word(packetBuffer[40], packetBuffer[41]);
    unsigned long lowWord = word(packetBuffer[42], packetBuffer[43]);
    // combine the four bytes (two words) into a long integer
    // this is NTP time (seconds since Jan 1 1900):
    secsSince1900 = highWord << 16 | lowWord;
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("Seconds since Jan 1 1900 = " );
      Serial.println(secsSince1900);
    }

    // now convert NTP time into everyday time:
    // Unix time starts on Jan 1 1970. In seconds, that's 2208988800:
    const unsigned long seventyYears = 2208988800UL;
    // subtract seventy years:
    epoch = secsSince1900 - seventyYears;
    setTime(epoch);

  }
}

void Read_Button(boolean IlsPorte, boolean Verrou)
{
  int DebounseCpt = 0;
  Old_Status_IlsPorte = Status_IlsPorte;
  Old_Status_Verrou = Status_Verrou;
  int Status_IlsPorte_Cpt = 0;
  int Status_Verrou_Cpt = 0;
  int Threshold = 4;
  while (DebounseCpt <= MaxDebounse) {
    DebounseCpt = DebounseCpt + 1;
    if (digitalRead(IlsPorte) == LOW) Status_IlsPorte_Cpt = Status_IlsPorte_Cpt + 1; // ATTENTION - pour application reel : LOW (porte ouverte -> ILS ouvert -> LOW level via Ext pulldown)
    if (digitalRead(Verrou) == HIGH) Status_Verrou_Cpt = Status_Verrou_Cpt + 1; // ATTENTION - pour application reel : HIGH
    delay(100);
  }

  if (Status_IlsPorte_Cpt > Threshold) Status_IlsPorte = true; 
  else Status_IlsPorte = false;
  if (Status_Verrou_Cpt > Threshold ) Status_Verrou = true; 
  else Status_Verrou = false;
  if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("MAX debounse = ");
      Serial.println(MaxDebounse);
      Serial.print("Threshold = ");
      Serial.println(Threshold);
      Serial.print("Status_IlsPorte_Cpt = ");
      Serial.println(Status_IlsPorte_Cpt);
      Serial.print("Status_Verrou_Cpt = ");
      Serial.println(Status_Verrou_Cpt);
   
    }
  if (!((Status_IlsPorte == Old_Status_IlsPorte) && (Status_Verrou == Old_Status_Verrou)))
  {
    Update_needed = true;
  }
}

// send an NTP request to the time server at the given address
//unsigned long sendNTPpacket(IPAddress& address)
void sendNTPpacket(IPAddress& address)
{
  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("sending NTP packet...");
  }
  // set all bytes in the buffer to 0
  memset(packetBuffer, 0, NTP_PACKET_SIZE);
  // Initialize values needed to form NTP request
  // (see URL above for details on the packets)
  packetBuffer[0] = 0b11100011;   // LI, Version, Mode
  packetBuffer[1] = 0;     // Stratum, or type of clock
  packetBuffer[2] = 6;     // Polling Interval
  packetBuffer[3] = 0xEC;  // Peer Clock Precision
  // 8 bytes of zero for Root Delay & Root Dispersion
  packetBuffer[12]  = 49;
  packetBuffer[13]  = 0x4E;
  packetBuffer[14]  = 49;
  packetBuffer[15]  = 52;

  // all NTP fields have been given values, now
  // you can send a packet requesting a timestamp:
  udp.beginPacket(address, 123); //NTP requests are to port 123
  udp.write(packetBuffer, NTP_PACKET_SIZE);
  udp.endPacket();
}

void sendDailyMail() {    
    GetTimeByUDP();
    Read_Button(IlsPorte, Verrou);
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println();
      Serial.println("Daily mail");
    }
    MailContent = String("Daily report: rue de Vaugirard \r\n");
    if (sendEmail(MailFrom, MailTo, MailContent, ThingspeakChannelAdress, ThingspeakWriteAPIKey)) { // Mail sent success
      DailyMailSent = true;
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email sent");
      }
    }
    else // Mail sent failure
    {
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email not sent - System frozen for 3 minutes");
      }
      delay(180000); // on bloque l'envoie du Daily mai pour 3 minutes avant prochain envoie
    }
  }//FIN sendDailyMail

byte sendEmail(String FcMailFrom, String FcMailTo, String FcMailContent, String FcThingspeakChannelAdress, String FcThingspeakChannelWriteAPIKey)
{
  if (!AvecMail) return 0; // sort de la procedure sans envoyer le mail si Avec mail=0

  if (client.connect(server_email, 25)) {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("connected");
    }
  } else {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("connection failed");
    }
    return 0;
  }

  if (!eRcv()) return 0;

  // change to your public ip
  client.println("helo 10.62.66.144");

  if (!eRcv()) return 0;
  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("Sending From");
  }

  // change to your email address (sender)
  client.print("MAIL From: ");
  client.println(FcMailFrom);// contient l'adresse email de l'expediteur "<toto@titi.fr>"

  if (!eRcv()) return 0;

  // change to recipient address
  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("Sending To");
  }
  client.print("RCPT To: ");
  client.println(FcMailTo);// contient l'adresse email du destinataire "<toto@titi.fr>"
  if (!eRcv()) return 0;

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("Sending DATA");
  }

  client.println("DATA");
  if (!eRcv()) return 0;


  //*****************Creation du Mail***********************
  client.print("To: You "); // Destinataire
  client.println(FcMailTo); // Destinataire
  client.print("From: Me "); // My address
  client.println(FcMailFrom); // My address
  client.println("Subject: Arduino Report from Maison Paris\r\n"); //sujet du mail
  //Corps du mail
  client.print(FcMailContent); // message specifique de l'application appelante

  if ((Status_IlsPorte == false) && (Status_Verrou == false)) {
    client.println("La porte d'entree est : fermee et verouillee\r\n");
  }
  if ((Status_IlsPorte == false) && (Status_Verrou == true)) {
    client.println("La porte d'entree est : fermee et non verouillee\r\n");
  }
  if ((Status_IlsPorte == true) && (Status_Verrou == false)) {
    client.println("La porte d'entree est : ouverte et verouillee\r\n");
  }
  if ((Status_IlsPorte == true) && (Status_Verrou == true)) {
    client.println("La porte d'entree est : ouverte et non verouillee\r\n");
  }

  client.print(StringDate);
  client.println(StringTime);

  client.println(FcThingspeakChannelAdress);

